{
  "auto_mapping": null,
  "base_model_name_or_path": "google/flan-t5-small",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 256,
  "lora_dropout": 0.02,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 128,
  "revision": null,
  "target_modules": [
    "q",
    "v"
  ],
  "task_type": "SEQ_2_SEQ_LM"
}